serverless/going-serverless-book/day-service/artillery/day-service.yaml
config:
  target: https://jxn7tl7twc.execute-api.eu-west-1.amazonaws.com/dev
  phases:
    - duration: 60
      arrivalRate: 10
  defaults:
    headers:
      x-api-key: "{{ $processEnvironment.SERVICE_API_KEY }}"
scenarios:
  - flow:
      - post:
          url: "/calculate-day"
          json:
            date: "22 May 2017"